Tekla.Structures.ModelInternal.dotEdgeChamfer_t
Serialization structure for EdgeChamfer.

Tekla.Structures.ModelInternal.dotEdgeChamfer_t.Boolean
Boolean is the base class for operation. It defines e.g. the father part of the operation.

Tekla.Structures.ModelInternal.dotEdgeChamfer_t.Chamfer
Chamfer values for edge chamfer.

Tekla.Structures.ModelInternal.dotEdgeChamfer_t.FirstEnd
The first input point.

Tekla.Structures.ModelInternal.dotEdgeChamfer_t.SecondEnd
The first input point.

Tekla.Structures.ModelInternal.dotEdgeChamfer_t.FirstChamferEndType
The first input point.

Tekla.Structures.ModelInternal.dotEdgeChamfer_t.FirstBevelDimension
The first input point.

Tekla.Structures.ModelInternal.dotEdgeChamfer_t.SecondChamferEndType
The first input point.

Tekla.Structures.ModelInternal.dotEdgeChamfer_t.SecondBevelDimension
The first input point.

Tekla.Structures.ModelInternal.dotEdgeChamfer_t.aName
The name of the edge chamfer.